### Pandas-dataframe used to data cleaning and data analysis

In [2]:
import pandas as pd

In [3]:
## series
## A pandas Series is a one dimensional array-like obejct that can hold any data type.

In [4]:
import pandas as pd # type: ignore
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
## series from dictionary element
data={'a':1,'b':2,'c':3,'d':4}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
#data frame
data={
    'Name':['john','rock','alice'],
    'age':[24,3,4],
    'City':['Benglore','Newyork','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  age      City
0   john   24  Benglore
1   rock    3   Newyork
2  alice    4   Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
## accessing data from dataframe
# data['Name']
df['Name']

0     john
1     rock
2    alice
Name: Name, dtype: object

In [ ]:
# row index using loc operation
df.loc[0] # location row wise

Name        john
age           24
City    Benglore
Name: 0, dtype: object

In [ ]:
df.iloc[0][1] # index location in row perticluar column we can give it here

C:\Users\shara\AppData\Local\Temp\ipykernel_7400\996086243.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1] # index location

np.int64(24)

In [16]:
df

    Name  age      City
0   john   24  Benglore
1   rock    3   Newyork
2  alice    4   Florida

In [17]:
# Accessing perticular element
df.at[1,'City']

'Newyork'

In [20]:
# Accessing speciefed elemeny using iat
df.iat[0,2]

'Benglore'

In [26]:
# adding new column to the dataframe
df['Salaray']=[1000,2000,3000]
df

    Name  age      City  Salaray
0   john   24  Benglore     1000
1   rock    3   Newyork     2000
2  alice    4   Florida     3000

In [28]:
df.drop('Salaray',axis=1)

    Name  age      City
0   john   24  Benglore
1   rock    3   Newyork
2  alice    4   Florida

In [29]:
df

    Name  age      City  Salaray
0   john   24  Benglore     1000
1   rock    3   Newyork     2000
2  alice    4   Florida     3000

In [31]:
# inorder delete at permanently we need to add inplace=true then it will delete permanently
df.drop('Salaray',axis=1,inplace=True)

In [32]:
df

    Name  age      City
0   john   24  Benglore
1   rock    3   Newyork
2  alice    4   Florida

In [34]:
# add age to all column 
df['age']=df['age']+1
df

    Name  age      City
0   john   25  Benglore
1   rock    4   Newyork
2  alice    5   Florida